Tekla.Structures.DrawingInternal.dak_eventtype_t


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_NONE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_DOWN1


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_DOWN2


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_DRAG1


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_DRAG2


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_UP1


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_UP2


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_CLICK1


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_CLICK2


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_TABLECLICK


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_EXPOSE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_CANCEL


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_SELECT


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_EXTEND


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_TOGGLE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_QUERYMOVE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_MULTISELECT


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_QUERYRESIZE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_MULTIEXTEND


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_QUERYROTATE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_MULTITOGGLE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_ACTIVATE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_STARTPOLYSELECT


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_POLYSELECT


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_STARTPOLYEXTEND


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_POLYEXTEND


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_STARTPOLYTOGGLE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_POLYTOGGLE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_STARTMOVE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_INMOVE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_MOVE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_STARTRESIZE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_INRESIZE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_RESIZE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_STARTROTATE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_INROTATE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_ROTATE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_POLYEND


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_HIDE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_SHOW


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_BUTTONPRESS


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_DOUBLECLICK


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_BUTTONRELEASE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_MOUSEMOVE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_ENTER


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_LEAVE


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_KEYPRESS


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_POPUPMENU


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_TIMER


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_MOUSEWHEEL


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_DIGIT


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_DIALOGPOPUPMENU


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_QUERYDRAGNDROP


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_INDRAGNDROP


Tekla.Structures.DrawingInternal.dak_eventtype_t.DAK_EVENT_DRAGNDROP
